#### pandas

In [ ]:
### pandas use cases:
* data transformation
* data anlysis
* data cleaning
 
#### pandas notations:
* series-----creating the data
* dataframe----for making the data in a particular tabular format

In [14]:
import pandas as pd
internal1={'s1':20,'s2':10,'s3':30}
internal1=pd.Series(internal1)
print(internal1)
internal2={'s1':10,'s2':20,'s3':30}
internal2=pd.Series(internal2)
print(internal2)

s1    20
s2    10
s3    30
dtype: int64
s1    10
s2    20
s3    30
dtype: int64

In [29]:
import pandas as pd
internal1={'s1':20,'s2':10,'s3':30}
internal1=pd.Series(internal1)
print(internal1)
internal2={'s1':10,'s2':20,'s3':30}
internal2=pd.Series(internal2)
print(internal2)
internal3={'s1':30,'s2':20,'s3':10}
internal3=pd.Series(internal3)
print(internal3)
final={'i1':internal1,'i2':internal2,'i3':internal3}
final=pd.DataFrame(final)
final

s1    20
s2    10
s3    30
dtype: int64
s1    10
s2    20
s3    30
dtype: int64
s1    30
s2    20
s3    10
dtype: int64

    i1  i2  i3
s1  20  10  30
s2  10  20  20
s3  30  30  10

In [38]:
final={'internal1':s1,"internal2".:s2}
final=pd.dataFrame(final)
print(final)
final

SyntaxError: invalid syntax (<ipython-input-38-ad5d88ce798d>, line 1)

In [15]:

internal1={'a':20,'b':10,'c':30,'d':20}
internal1=pd.Series(internal1)
print(internal1)
internal2={'a':10,'b':20,'c':30,'d':20}
internal2=pd.Series(internal2)
print(internal2)

a    20
b    10
c    30
d    20
dtype: int64
a    10
b    20
c    30
d    20
dtype: int64

In [21]:
sub1={'aaa':80,'bbb':70,'ccc':60}
sub2={'aaa':90,'bbb':80,'ccc':70}
sub3={'aaa':750,'bbb':60,'ccc':80}
sub1.pd [Series(sub1)]
sub2.pd [Series(sub2)]
sub3.pd [Series(sub3)]
final=('maths':sub1,'physics':sub2,'chemistry':sub3)
final.pd.dataframe(final)
final

SyntaxError: invalid syntax (<ipython-input-21-aa7f86b7a2d8>, line 7)

In [17]:
final.values[2]

NameError: name 'final' is not defined

In [31]:
final.values[0,0]

20

In [32]:
for i in final values:

SyntaxError: invalid syntax (<ipython-input-32-3a9f24acb17c>, line 1)

In [33]:
final.drop

<bound method DataFrame.drop of     i1  i2  i3
s1  20  10  30
s2  10  20  20
s3  30  30  10>

In [42]:
final.values[2]=[12,30]

ValueError: cannot copy sequence with size 2 to array axis with dimension 3

In [54]:
### reading the csv files using pandas:
import pandas as pd
income=pd.read_csv("income.csv")
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

income

In [55]:
for i in income.values:
    print(i[1],":",i[10])

Alabama : 41381
Alaska : 61137
Arizona : 50602
Arkansas : 39919
California : 57528

In [62]:
s=0
for i in range (2,11):
    s+=income.values[2][i]
print(s)

424933

In [61]:
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [58]:
#1.average income of alaska in all years
s=c=0
for i in range(2,11):
    s=i+income.values[2][i]
    c+=1
print("average income of alaska in all years",(s//c))

average income of alaska in all years 5623

In [60]:
#2.average income of all states in 2012
s=c=0
for i in income.values:
    s=i+income.values
    c+=1
print("average income of alaska in all years",(s//c))

TypeError: unsupported operand type(s) for //: 'str' and 'int'

In [49]:
#3.create a function to print all columns in a single line
def fun():

In [ ]:
#4.create a function to access a row based on a unique column value
def fun(a):

In [ ]:
#5.create a function to find average income of all states from 2005 to 2013